ganhailin/wm_sdk_w801/include/wm_regs.h
#define IO_PB_BASE_ADDR		(HR_APB_BASE_ADDR + 0x1400)
#define IO_PB_DATA				(*(volatile unsigned int*)(IO_PB_BASE_ADDR + 0x0))
#define IO_PB_EN				(*(volatile unsigned int*)(IO_PB_BASE_ADDR + 0x4))
#define IO_PB_DIR				(*(volatile unsigned int*)(IO_PB_BASE_ADDR + 0x8))
#define IO_PB_REN				(*(volatile unsigned int*)(IO_PB_BASE_ADDR + 0xC))
#define IO_PB_AFSEL				(*(volatile unsigned int*)(IO_PB_BASE_ADDR + 0x10))
#define IO_PB_AFS1				(*(volatile unsigned int*)(IO_PB_BASE_ADDR + 0x14))
#define IO_PB_AFS0				(*(volatile unsigned int*)(IO_PB_BASE_ADDR + 0x18))

/***************************************************************
 * TIMER Reg
 ***************************************************************/
#define HR_TIMER_BASE_ADDR          (HR_APB_BASE_ADDR + 0x1800)
#define HR_TIMER_CFG                (HR_TIMER_BASE_ADDR + 0x0)
#define HR_TIMER0_5_CSR				(HR_TIMER_BASE_ADDR + 0x04)
#define HR_TIMER0_PRD				(HR_TIMER_BASE_ADDR + 0x08)
#define HR_TIMER1_PRD				(HR_TIMER_BASE_ADDR + 0x0C)
#define HR_TIMER2_PRD				(HR_TIMER_BASE_ADDR + 0x10)
#define HR_TIMER3_PRD				(HR_TIMER_BASE_ADDR + 0x14)
#define HR_TIMER4_PRD				(HR_TIMER_BASE_ADDR + 0x18)
#define HR_TIMER5_PRD				(HR_TIMER_BASE_ADDR + 0x1C)
#define HR_TIMER0_CNT				(HR_TIMER_BASE_ADDR + 0x20)
#define HR_TIMER1_CNT				(HR_TIMER_BASE_ADDR + 0x24)
#define HR_TIMER2_CNT				(HR_TIMER_BASE_ADDR + 0x28)
#define HR_TIMER3_CNT				(HR_TIMER_BASE_ADDR + 0x2C)
#define HR_TIMER4_CNT				(HR_TIMER_BASE_ADDR + 0x30)
#define HR_TIMER5_CNT				(HR_TIMER_BASE_ADDR + 0x34)

/* timer csr bits defintion */
#define TLS_TIMER_MS_UNIT(n)               (1UL<<(0+5*n))
#define TLS_TIMER_ONE_TIME(n)              (1UL<<(1+5*n))
#define TLS_TIMER_EN(n)                    (1UL<<(2+5*n))
#define TLS_TIMER_INT_EN(n)                (1UL<<(3+5*n))
#define TLS_TIMER_INT_CLR(n)            (1UL<<(4+5*n))

/***************************************************************
 * WATCH DOG Reg
 ***************************************************************/
#define HR_WDG_BASE_ADDR            (HR_APB_BASE_ADDR + 0x1600)
#define HR_WDG_LOAD_VALUE           (HR_WDG_BASE_ADDR + 0x00)
#define HR_WDG_CUR_VALUE            (HR_WDG_BASE_ADDR + 0x04)
#define HR_WDG_CTRL                 (HR_WDG_BASE_ADDR + 0x08)
#define HR_WDG_INT_CLR             	(HR_WDG_BASE_ADDR + 0x0C)
#define HR_WDG_INT_SRC              (HR_WDG_BASE_ADDR + 0x10)
#define HR_WDG_INT_MIS              (HR_WDG_BASE_ADDR + 0x14)
#define HR_WDG_LOCK                 (HR_WDG_BASE_ADDR + 0x40)

/** bit field of the lcd gate control in CLK gating register */
#define HR_CLK_LCD_GATE_Pos			(14)

/***********************************************************//**
 * LCD Reg
 ***************************************************************/

#define HR_LCD_REG_BASE     		 (HR_APB_BASE_ADDR + 0x1C00) //(0x4001 1C00)
#define HR_LCD_CR				     (HR_LCD_REG_BASE+0x000)
#define HR_LCD_FRAME_CNT     		 (HR_LCD_REG_BASE+0x004)
#define HR_LCD_COM0_SEG     	     (HR_LCD_REG_BASE+0x008)
#define HR_LCD_COM1_SEG     	     (HR_LCD_REG_BASE+0x00C)
#define HR_LCD_COM2_SEG     	     (HR_LCD_REG_BASE+0x010)
#define HR_LCD_COM3_SEG     	     (HR_LCD_REG_BASE+0x014)
#define HR_LCD_COM4_SEG     	     (HR_LCD_REG_BASE+0x018)
#define HR_LCD_COM5_SEG     	     (HR_LCD_REG_BASE+0x01C)
#define HR_LCD_COM6_SEG     	     (HR_LCD_REG_BASE+0x020)
#define HR_LCD_COM7_SEG     	     (HR_LCD_REG_BASE+0x024)
#define HR_LCD_COM_EN			     (HR_LCD_REG_BASE+0x028)
#define HR_LCD_SEG_EN			     (HR_LCD_REG_BASE+0x02C)

#define LCD_CR_EN_Pos				 (8)
#define LCD_CR_PD_Pos				 (9)

#define LCD_VDD_ON				     (1UL<<9)
#define LCD_VDD_OFF				     (0UL<<9)
#define LCD_EN						 (1UL<<8)

#define LCD_BIAS_MASK				 (3UL<<6)
#define LCD_BIAS_MASK_Pos			 (6)
#define LCD_BIAS_ONEFOURTH			 (0UL<<6)
#define LCD_BIAS_ONEHALF			 (1UL<<6)
#define LCD_BIAS_ONETHIRD			 (2UL<<6)
#define LCD_BIAS_STATIC				 (3UL<<6)

#define LCD_VLCD_MASK				 (7UL<<3)
#define LCD_VLCD_MASK_Pos			 (3)
#define LCD_VLCD_27					 (0UL<<3)
#define LCD_VLCD_29					 (1UL<<3)
#define LCD_VLCD_31					 (2UL<<3)
#define LCD_VLCD_33					 (3UL<<3)

#define LCD_DUTY_MASK				 (7UL<<0)
#define LCD_DUTY_MASK_Pos			 (0)
#define LCD_DUTY_STATIC				 (0UL<<0)
#define LCD_DUTY_ONEHALF			 (1UL<<0)
#define LCD_DUTY_ONETHIRD			 (2UL<<0)
#define LCD_DUTY_ONEFOURTH			 (3UL<<0)
#define LCD_DUTY_ONEFIFTH			 (4UL<<0)
#define LCD_DUTY_ONESIXTH			 (5UL<<0)
#define LCD_DUTY_ONESEVENTH			 (6UL<<0)
#define LCD_DUTY_ONEEIGHTH			 (7UL<<0)

/***********************************************************//**
 * I2S Reg
 ***************************************************************/
#define HR_CLK_I2S_GATE_Pos						(10)


#define HR_I2S_REG_BASE					 (HR_APB_BASE_ADDR+0x2000)
#define HR_I2S_CTRL			      	 (HR_I2S_REG_BASE+0x000)
#define HR_I2S_INT_MASK     		 (HR_I2S_REG_BASE+0x004)
#define HR_I2S_INT_SRC		     	 (HR_I2S_REG_BASE+0x008)
#define HR_I2S_STATUS			   		 (HR_I2S_REG_BASE+0x00C)
#define HR_I2S_TX					  		 (HR_I2S_REG_BASE+0x010)
#define HR_I2S_RX					  		 (HR_I2S_REG_BASE+0x014)

/*****************************************************************/
/* APB2SPI modem spi access register definition(BT)              */
/*****************************************************************/
#define APB2SPI_REG_BASE             (HR_APB_BASE_ADDR+ 0x2200)
#define APB2SPI_REG_CFG              (APB2SPI_REG_BASE+ 0x0000)
#define APB2SPI_REG_PS_CR            (APB2SPI_REG_BASE+ 0x0004)
#define APB2SPI_REG_TX_DATA          (APB2SPI_REG_BASE+ 0x0008)
#define APB2SPI_REG_RX_DATA          (APB2SPI_REG_BASE+ 0x000C)

/******************************************************************************/
/*                                                                            */
/*                        PWM                                                 */
/*                                                                            */
/******************************************************************************/
#define HR_PWM_REG_BASE                 (HR_APB_BASE_ADDR+0x1E00)
#define HR_PWM_CLKDIV01                 (HR_PWM_REG_BASE+0x0000)
#define HR_PWM_CLKDIV23                 (HR_PWM_REG_BASE+0x0004)
#define HR_PWM_CTL                      (HR_PWM_REG_BASE+0x0008)
#define HR_PWM_PERIOD                   (HR_PWM_REG_BASE+0x000C)
#define HR_PWM_PNUM                     (HR_PWM_REG_BASE+0x0010)
#define HR_PWM_CMPDAT                   (HR_PWM_REG_BASE+0x0014)
#define HR_PWM_DTCTL                    (HR_PWM_REG_BASE+0x0018)
#define HR_PWM_INTEN                    (HR_PWM_REG_BASE+0x001C)
#define HR_PWM_INTSTS                   (HR_PWM_REG_BASE+0x0020)
#define HR_PWM_CAPDAT                   (HR_PWM_REG_BASE+0x0024)
#define HR_PWM_BRKCTL                   (HR_PWM_REG_BASE+0x0028)
#define HR_PWM_CH4_REG1                 (HR_PWM_REG_BASE+0x002C)
#define HR_PWM_CH4_REG2                 (HR_PWM_REG_BASE+0x0030)
#define HR_PWM_CAP2DAT                  (HR_PWM_REG_BASE+0x0034)
#define HR_PWM_CAP2CTL                  (HR_PWM_REG_BASE+0x0038)


/******************************************************************************/
/*                                                                            */
/*                        TOUCH SENSOR                                        */
/*                                                                            */
/******************************************************************************/
#define HR_TC_REG_BASE                 (HR_APB_BASE_ADDR+0x2400)

#define HR_TC_CONFIG                    (HR_TC_REG_BASE+0x0000)
#define SCAN_PERID_SHIFT_BIT            (26)
#define CAPDET_CNT_SHIFT_BIT            (20)
#define TOUCH_SENSOR_SEL_SHIFT_BIT      (4)
#define TOUCH_SENSOR_EN_BIT             (0)

#define HR_TC1_TRESHOLD_REG              (HR_TC_REG_BASE+0x0004)
#define HR_TC1_COUNT_REG                 (HR_TC_REG_BASE+0x0004)

#define HR_TC2_TRESHOLD_REG              (HR_TC_REG_BASE+0x0008)
#define HR_TC2_COUNT_REG                 (HR_TC_REG_BASE+0x0008)

#define HR_TC3_TRESHOLD_REG              (HR_TC_REG_BASE+0x000C)
#define HR_TC3_COUNT_REG                 (HR_TC_REG_BASE+0x000C)

#define HR_TC4_TRESHOLD_REG              (HR_TC_REG_BASE+0x0010)
#define HR_TC4_COUNT_REG                 (HR_TC_REG_BASE+0x0010)

#define HR_TC5_TRESHOLD_REG              (HR_TC_REG_BASE+0x0014)
#define HR_TC5_COUNT_REG                 (HR_TC_REG_BASE+0x0014)

#define HR_TC6_TRESHOLD_REG              (HR_TC_REG_BASE+0x0018)
#define HR_TC6_COUNT_REG                 (HR_TC_REG_BASE+0x0018)

