ganhailin/wm_sdk_w801/include/wm_regs.h
#define HR_TC7_TRESHOLD_REG              (HR_TC_REG_BASE+0x001C)
#define HR_TC7_COUNT_REG                 (HR_TC_REG_BASE+0x001C)

#define HR_TC8_TRESHOLD_REG              (HR_TC_REG_BASE+0x0020)
#define HR_TC8_COUNT_REG                 (HR_TC_REG_BASE+0x0020)

#define HR_TC9_TRESHOLD_REG              (HR_TC_REG_BASE+0x0024)
#define HR_TC9_COUNT_REG                 (HR_TC_REG_BASE+0x0024)

#define HR_TC10_TRESHOLD_REG             (HR_TC_REG_BASE+0x0028)
#define HR_TC10_COUNT_REG                (HR_TC_REG_BASE+0x0028)

#define HR_TC11_TRESHOLD_REG             (HR_TC_REG_BASE+0x002C)
#define HR_TC11_COUNT_REG                (HR_TC_REG_BASE+0x002C)

#define HR_TC12_TRESHOLD_REG             (HR_TC_REG_BASE+0x0030)
#define HR_TC12_COUNT_REG                (HR_TC_REG_BASE+0x0030)

#define HR_TC13_TRESHOLD_REG             (HR_TC_REG_BASE+0x0034)
#define HR_TC13_COUNT_REG                (HR_TC_REG_BASE+0x0034)

#define HR_TC14_TRESHOLD_REG             (HR_TC_REG_BASE+0x0038)
#define HR_TC14_COUNT_REG                (HR_TC_REG_BASE+0x0038)

#define HR_TC15_TRESHOLD_REG             (HR_TC_REG_BASE+0x003C)
#define HR_TC15_COUNT_REG                (HR_TC_REG_BASE+0x003C)

#define HR_TC16_TRESHOLD_REG             (HR_TC_REG_BASE+0x0040)
#define HR_TC16_COUNT_REG                (HR_TC_REG_BASE+0x0040)

#define HR_TC_INT_EN	                 (HR_TC_REG_BASE+0x0044) /*bit 31:16*/
#define HR_TC_INT_STATUS                 (HR_TC_REG_BASE+0x0044) /*bit 15:0*/ 


/**
 * @defgroup System_APIs System APIs
 * @brief System APIs
 */

/**
 * @addtogroup System_APIs
 * @{
 */

/**
 * @defgroup REG_APIs REG APIs
 * @brief Register operate APIs
 */

/**
 * @addtogroup REG_APIs
 * @{
 */

/**
 * @brief          This function is used to write value to register or memory
 *
 * @param[in]      reg    address to be written
 * @param[in]      val    value to write
 *
 * @return         None
 *
 * @note           None
 */
static __inline void tls_reg_write32(unsigned int reg, unsigned int val)
{
    *(TLS_REG *)reg = val;
}


/**
 * @brief          This function is used to read value from register or memory
 *
 * @param[in]      reg    address to read
 *
 * @retval         val    read from register or memory
 *
 * @note           None
 */
static __inline unsigned int tls_reg_read32(unsigned int reg)
{
    unsigned int val = *(TLS_REG *)reg;
    return val;
}


/**
 * @brief          This function is used to write specified bit through
                   bit-band alias region
 *
 * @param[in]      addr    32-bit aligned byte address where the bit exists.
 * @param[in]      bit     Bit position.
 * @param[in]      val     The value that the bit is set to, 0 or 1.
 *
 * @return         None
 *
 * @note           Only when bit-band mechnism is supported, you can use it
 */
static __inline void tls_bitband_write(volatile unsigned int addr, unsigned int bit, unsigned int val)
{
	unsigned int temp;

	temp = (M32(addr) & ~(1 << bit)) | (val << bit);

	*((volatile unsigned int * )addr) = temp;
}

/**
 * @brief          This function is used to read a single bit from address
                   by bit-band alias region
 *
 * @param[in]      addr    32-bit aligned byte address where the bit exists
 * @param[in]      bit     Bit position
 *
 * @retval         The value of the requested bit
 *
 * @note           Only when bit-band mechnism is supported, you can use it
 */
static __inline unsigned int tls_bitband_read(volatile unsigned int addr, unsigned int bit)
{
	unsigned int temp;

	temp = (M32(addr) >> bit) & 0x1;

	return *((volatile unsigned int *)temp);
}


/**
 * @}
 */

/**
 * @}
 */

#endif /* WM_REGS_H */

